<template>
  <CommonPartsTemplate :image-path="imagePath">
    <template #content>
      <div class="cast-staff-main">
        <div class="cast-staff-title cast-ttile">
          <div>CAST</div>
        </div>

        <div class="cast-block">
          <svg
            id="cast_pc_overlay.svg"
            xmlns="http://www.w3.org/2000/svg"
            width="811"
            height="992"
            viewBox="0 0 811 992"
            class="sc-higXBA bYYIwB"
          >
            <rect
              id="comment-06"
              x="337"
              y="74"
              width="146"
              height="33"
              rx="3"
              ry="3"
              class="sc-iNqMTl hFrbFX"
              @click="CastStaffModal(0)"
            />
            <path id="COMMENT" d="M374.994,96.278a5.67,5.67,0,0,0,4.708-2.1l-2.234-1.995a2.836,2.836,0,0,1-2.294,1.23,2.63,2.63,0,0,1,0-5.249,2.836,2.836,0,0,1,2.294,1.23L379.7,87.4a5.67,5.67,0,0,0-4.708-2.1c-3.374,0-5.848,2.265-5.848,5.489S371.62,96.278,374.994,96.278Zm11.1,0c3.418,0,5.922-2.31,5.922-5.489s-2.5-5.489-5.922-5.489-5.923,2.31-5.923,5.489S382.68,96.278,386.1,96.278Zm0-2.864a2.64,2.64,0,1,1,2.354-2.625A2.388,2.388,0,0,1,386.1,93.414Zm19.626,2.625-0.03-10.5h-2.909l-3.329,5.594-3.418-5.594H393.13v10.5h3.223V91.419l2.28,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm14.539,0-0.03-10.5h-2.909L414,91.134l-3.418-5.594h-2.909v10.5h3.224V91.419l2.279,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm5.423-2.67v-1.38h4.438v-2.55h-4.438V88.21h5.053V85.54h-8.532v10.5h8.727v-2.67h-5.248Zm13.446-7.829v4.769l-3.989-4.769h-2.909v10.5h3.449V91.269l3.988,4.769h2.909V85.54h-3.448Zm7.414,10.5h3.539V88.285h3.073V85.54h-9.686v2.745h3.074v7.754Z" class="sc-jeGSBP iRgiNB" />
          </svg>

          <img
            class="cast-image"
            src="/images/cast-image.svg"
          >
        </div>

        <div class="cast-staff-title">
          <div>STAFF</div>
        </div>

        <div class="staff-block">
          <svg
            id="staff_pc_overlay.svg"
            xmlns="http://www.w3.org/2000/svg"
            width="794"
            height="853"
            viewBox="0 0 794 853"
            class="sc-higXBA bYYIwB"
          >
            <rect
              id="comment-05"
              x="551"
              y="618"
              width="146"
              height="33"
              rx="3"
              ry="3"
              class="sc-iNqMTl hFrbFX"
              @click="CastStaffModal(1)"
            />
            <path id="comment-05-text" d="M588.994,640.278a5.672,5.672,0,0,0,4.708-2.1l-2.234-2a2.836,2.836,0,0,1-2.294,1.23,2.63,2.63,0,0,1,0-5.249,2.835,2.835,0,0,1,2.294,1.229L593.7,631.4a5.67,5.67,0,0,0-4.708-2.1c-3.374,0-5.848,2.265-5.848,5.489S585.62,640.278,588.994,640.278Zm11.105,0c3.418,0,5.922-2.309,5.922-5.489s-2.5-5.489-5.922-5.489-5.923,2.31-5.923,5.489S596.68,640.278,600.1,640.278Zm0-2.864a2.64,2.64,0,1,1,2.354-2.625A2.388,2.388,0,0,1,600.1,637.414Zm19.626,2.624-0.03-10.5h-2.909l-3.329,5.594-3.418-5.594H607.13v10.5h3.223v-4.619l2.28,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm14.539,0-0.03-10.5h-2.909L628,635.134l-3.418-5.594h-2.909v10.5h3.224v-4.619l2.279,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm5.423-2.669v-1.38h4.438v-2.55h-4.438V632.21h5.053v-2.67h-8.532v10.5h8.727v-2.669h-5.248Zm13.446-7.829v4.769l-3.989-4.769h-2.909v10.5h3.449v-4.769l3.988,4.769h2.909v-10.5h-3.448Zm7.414,10.5h3.539v-7.754h3.073V629.54h-9.686v2.744h3.074v7.754Z" class="sc-jeGSBP iRgiNB" />
            <rect
              id="comment-04"
              x="325"
              y="618"
              width="146"
              height="33"
              rx="3"
              ry="3"
              class="sc-iNqMTl hFrbFX"
              @click="CastStaffModal(2)"
            />
            <path id="comment-04-text" d="M362.994,640.278a5.672,5.672,0,0,0,4.708-2.1l-2.234-2a2.836,2.836,0,0,1-2.294,1.23,2.63,2.63,0,0,1,0-5.249,2.835,2.835,0,0,1,2.294,1.229L367.7,631.4a5.67,5.67,0,0,0-4.708-2.1c-3.374,0-5.848,2.265-5.848,5.489S359.62,640.278,362.994,640.278Zm11.1,0c3.418,0,5.922-2.309,5.922-5.489s-2.5-5.489-5.922-5.489-5.923,2.31-5.923,5.489S370.68,640.278,374.1,640.278Zm0-2.864a2.64,2.64,0,1,1,2.354-2.625A2.388,2.388,0,0,1,374.1,637.414Zm19.626,2.624-0.03-10.5h-2.909l-3.329,5.594-3.418-5.594H381.13v10.5h3.223v-4.619l2.28,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm14.539,0-0.03-10.5h-2.909L402,635.134l-3.418-5.594h-2.909v10.5h3.224v-4.619l2.279,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm5.423-2.669v-1.38h4.438v-2.55h-4.438V632.21h5.053v-2.67h-8.532v10.5h8.727v-2.669h-5.248Zm13.446-7.829v4.769l-3.989-4.769h-2.909v10.5h3.449v-4.769l3.988,4.769h2.909v-10.5h-3.448Zm7.414,10.5h3.539v-7.754h3.073V629.54h-9.686v2.744h3.074v7.754Z" class="sc-jeGSBP iRgiNB" />
            <rect
              id="comment-03"
              x="101"
              y="618"
              width="146"
              height="33"
              rx="3"
              ry="3"
              class="sc-iNqMTl hFrbFX"
              @click="CastStaffModal(3)"
            />
            <path id="comment-03-text" d="M138.994,640.278a5.672,5.672,0,0,0,4.708-2.1l-2.234-2a2.836,2.836,0,0,1-2.294,1.23,2.63,2.63,0,0,1,0-5.249,2.835,2.835,0,0,1,2.294,1.229L143.7,631.4a5.67,5.67,0,0,0-4.708-2.1c-3.374,0-5.848,2.265-5.848,5.489S135.62,640.278,138.994,640.278Zm11.1,0c3.418,0,5.922-2.309,5.922-5.489s-2.5-5.489-5.922-5.489-5.923,2.31-5.923,5.489S146.68,640.278,150.1,640.278Zm0-2.864a2.64,2.64,0,1,1,2.354-2.625A2.388,2.388,0,0,1,150.1,637.414Zm19.626,2.624-0.03-10.5h-2.909l-3.329,5.594-3.418-5.594H157.13v10.5h3.223v-4.619l2.28,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm14.539,0-0.03-10.5h-2.909L178,635.134l-3.418-5.594h-2.909v10.5h3.224v-4.619l2.279,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm5.423-2.669v-1.38h4.438v-2.55h-4.438V632.21h5.053v-2.67h-8.532v10.5h8.727v-2.669h-5.248Zm13.446-7.829v4.769l-3.989-4.769h-2.909v10.5h3.449v-4.769l3.988,4.769h2.909v-10.5h-3.448Zm7.414,10.5h3.539v-7.754h3.073V629.54h-9.686v2.744h3.074v7.754Z" class="sc-jeGSBP iRgiNB" />
            <rect
              id="comment-02"
              x="447"
              y="157"
              width="146"
              height="33"
              rx="3"
              ry="3"
              class="sc-iNqMTl hFrbFX"
              @click="CastStaffModal(4)"
            />
            <path id="comment-02-text" d="M484.994,179.278a5.672,5.672,0,0,0,4.708-2.1l-2.234-2a2.836,2.836,0,0,1-2.294,1.23,2.63,2.63,0,0,1,0-5.249,2.835,2.835,0,0,1,2.294,1.229L489.7,170.4a5.67,5.67,0,0,0-4.708-2.1c-3.374,0-5.848,2.265-5.848,5.489S481.62,179.278,484.994,179.278Zm11.1,0c3.418,0,5.922-2.309,5.922-5.489s-2.5-5.489-5.922-5.489-5.923,2.31-5.923,5.489S492.68,179.278,496.1,179.278Zm0-2.864a2.64,2.64,0,1,1,2.354-2.625A2.388,2.388,0,0,1,496.1,176.414Zm19.626,2.624-0.03-10.5h-2.909l-3.329,5.594-3.418-5.594H503.13v10.5h3.223v-4.619l2.28,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm14.539,0-0.03-10.5h-2.909L524,174.134l-3.418-5.594h-2.909v10.5h3.224v-4.619l2.279,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm5.423-2.669v-1.38h4.438v-2.55h-4.438V171.21h5.053v-2.67h-8.532v10.5h8.727v-2.669h-5.248Zm13.446-7.829v4.769l-3.989-4.769h-2.909v10.5h3.449v-4.769l3.988,4.769h2.909v-10.5h-3.448Zm7.414,10.5h3.539v-7.754h3.073V168.54h-9.686v2.744h3.074v7.754Z" class="sc-jeGSBP iRgiNB" />
            <rect
              id="comment-01"
              x="179"
              y="157"
              width="146"
              height="33"
              rx="3"
              ry="3"
              class="sc-iNqMTl hFrbFX"
              @click="CastStaffModal(5)"
            />
            <path id="comment-01-text" d="M216.994,179.278a5.672,5.672,0,0,0,4.708-2.1l-2.234-2a2.836,2.836,0,0,1-2.294,1.23,2.63,2.63,0,0,1,0-5.249,2.835,2.835,0,0,1,2.294,1.229L221.7,170.4a5.67,5.67,0,0,0-4.708-2.1c-3.374,0-5.848,2.265-5.848,5.489S213.62,179.278,216.994,179.278Zm11.1,0c3.418,0,5.922-2.309,5.922-5.489s-2.5-5.489-5.922-5.489-5.923,2.31-5.923,5.489S224.68,179.278,228.1,179.278Zm0-2.864a2.64,2.64,0,1,1,2.354-2.625A2.388,2.388,0,0,1,228.1,176.414Zm19.626,2.624-0.03-10.5h-2.909l-3.329,5.594-3.418-5.594H235.13v10.5h3.223v-4.619l2.28,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm14.539,0-0.03-10.5h-2.909L256,174.134l-3.418-5.594h-2.909v10.5h3.224v-4.619l2.279,3.674h1.559l2.279-3.839,0.03,4.784h3.224Zm5.423-2.669v-1.38h4.438v-2.55h-4.438V171.21h5.053v-2.67h-8.532v10.5h8.727v-2.669h-5.248Zm13.446-7.829v4.769l-3.989-4.769h-2.909v10.5h3.449v-4.769l3.988,4.769h2.909v-10.5h-3.448Zm7.414,10.5h3.539v-7.754h3.073V168.54h-9.686v2.744h3.074v7.754Z" class="sc-jeGSBP iRgiNB" />
          </svg>
          <img
            class="staff-image"
            src="/images/staff-image.svg"
          >
        </div>
      </div>
    </template>
  </CommonPartsTemplate>
</template>

<script lang="ts">
import { Vue, Component } from 'vue-property-decorator'

    @Component
export default class CastStaff extends Vue {
        showFlg:boolean = false;
        imagePath:string = '/images/cast-staff-title.svg';

        castStaff:Object[] = [
          {
            castName: '花江夏樹',
            position: '監督',
            castImage: 'odokawaDetail.png',
            castComment: '何やら面白そうなアニメです。僕が演じるタクシードライバーの小戸川は、今まで演じた事のないようなキャラクターなのですが、監督から指名でお話をいただきました。それは何故なのか・・・？ただ単に動物達が可愛いアニメではなさそうですね。物語が進むにつれて色々な事がわかっていき、どんどん面白くなるので、ぜひ放送を楽しみにしていて下さい。',
            castProfile: '2009年自身のグループPSGでの1stアルバム『David』発表以降、様々なシーンで幅広く活動中。 2017年1月に発売される宇多田ヒカル「光 -Ray of Hope MIX-」のオフィシャルRemixを担当し、同曲はプレイステーション用ゲームソフト「Kingdom Hearts HD 2.8」全世界共通のオフィシャル・テーマソングとして起用された。 2017年10月、初のソロアルバム『MODERN TIMES』を発表し、ワンマンツアーライブを開催。2020年7月、1stアルバム以来となる新作「The Sofakingdom」を発表。 11月にはPUNPEEが今まで限定的に発表してきた楽曲をコンパイルしたシリーズ「Small Token」を発表した。'
          }
        ]

        CastStaffModal (num) {
          const obj:Object = {
            modalType: 'CastStaffDetail',
            castStaff: this.castStaff[0]
            // castStaff:this.castStaff[num - 1]
          }
          this.$store.commit('store/setModalInfo', obj)
        }
}
</script>

<style scoped>
.cast-staff-main{
    margin:0 3%;
}

.cast-block svg ,
.staff-block svg{
    z-index:9;
}

.bYYIwB {
    position: absolute;
    top: 0px;
    left: 0px;
    width: 100%;
    height: auto;
}

.hFrbFX {
    cursor: pointer;
    fill: transparent;
    transition: all 0.1s ease 0s;
}
.hFrbFX:hover {
    fill: rgb(0, 0, 0);
}

.iRgiNB {
    fill: rgb(30, 91, 85);
    pointer-events: none;
}
.cast-block,
.staff-block{
    width:100%;
    position:relative;
}
.cast-block img,
.staff-block img{
    width:100%;
}

.cast-staff-title{
    text-align: center;
    font-size: 25px;
    font-weight: 900;
    border-bottom: 1px solid rgb(30, 91, 85);
    color: rgb(30, 91, 85);
    font-family: "Noto Sans JP", sans-serif;
    margin: 40px 0;
}
.cast-ttile{
    font-family: Montserrat, sans-serif;
    border-bottom: 1px solid rgb(244, 95, 74);
    color: rgb(244, 95, 74);
    margin-top:0;
}
</style>
